{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 3, 28, 28], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.15}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 32, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 64, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.15}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 64, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 128, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.15}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "filters": 128, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.15}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.15}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.15}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "activation": "linear"}}], "backend": "tensorflow"}