{"config": [{"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_first", "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 3, 36, 36], "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.15, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 32, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_first", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_first", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.15, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_first", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_first", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.15, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 128, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "relu", "data_format": "channels_first", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "kernel_size": [3, 3], "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.15, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "trainable": true, "units": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "noise_shape": null, "rate": 0.15, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_2", "trainable": true, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "noise_shape": null, "rate": 0.15, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "dense_3", "trainable": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.1.1", "backend": "tensorflow", "class_name": "Sequential"}