{"config": [{"config": {"padding": "same", "name": "conv2d_1", "data_format": "channels_first", "filters": 32, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "activation": "relu", "batch_input_shape": [null, 3, 36, 36], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "seed": null, "rate": 0.15, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "name": "conv2d_2", "data_format": "channels_first", "filters": 32, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "name": "conv2d_3", "data_format": "channels_first", "filters": 64, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_2", "seed": null, "rate": 0.15, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "name": "conv2d_4", "data_format": "channels_first", "filters": 64, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "name": "conv2d_5", "data_format": "channels_first", "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "seed": null, "rate": 0.15, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "name": "conv2d_6", "data_format": "channels_first", "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_4", "seed": null, "rate": 0.15, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "units": 1024, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "seed": null, "rate": 0.15, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "units": 512, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "seed": null, "rate": 0.15, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 2, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow"}