{"class_name": "Sequential", "keras_version": "2.1.1", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "batch_input_shape": [null, 3, 36, 36], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv2d_1", "filters": 32, "kernel_size": [3, 3], "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_regularizer": null, "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.15, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv2d_2", "filters": 32, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_first", "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv2d_3", "filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_first", "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.15, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv2d_4", "filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_first", "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv2d_5", "filters": 128, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_first", "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.15, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv2d_6", "filters": 128, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_first", "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.15, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_1", "units": 1024, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.15, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_2", "units": 512, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.15, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_3", "units": 2, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null}}]}