{"config": [{"config": {"activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "batch_input_shape": [null, 3, 36, 36], "dtype": "float32", "use_bias": true, "bias_constraint": null, "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"units": 1024, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "activity_regularizer": null, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"units": 512, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "activity_regularizer": null, "name": "dense_2", "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"units": 2, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_3", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}